{








  "note-to-future-self": "!!! this is not up to date. see resume.js instead !!!",







  "data": [
    {
      "title": "Experience",
      "column": [
        {
          "heading": "Lead Frontend Engineer",
          "subheading": [
            "Alqen - Des Moines, Iowa",
            "June 2021 - Present"
          ],
          "list": [
            "Maintained an existing Vue 2 application fixing bugs and adding features.",
            "Designed and implimented a completely new Vue 3 application that wraps the pieces of the legacy dashboard as part of an incremental adoption strategy.",
            "Ported legacy Vue 2 code to the new Vue 3 application.",
            "Implimented onboarding and payment flows for new users and subscriptions.",
            "Wrote a SSE (Server Sent Events) server in Node that receives miscellaneous events from our API service and forwared them to the frontend.",
            "Created a user impersonation system using JWTs for administrators.",
            "Took a leadership role and helped the team with strategizing and organizing our application at all levels."
          ]
        },
        {
          "heading": "Frontend Developer and Designer",
          "subheading": [
            "Self-employed - Des Moines, Iowa",
            "November 2019 - June 2021"
          ],
          "list": [
            "Learning and creating new apps, libraries, and frameworks.",
            "Various freelance developemnt and design."
          ]
        },
        {
          "heading": "Senior Software Developer",
          "subheading": [
            "Access Publishing Inc. - Johnston, Iowa",
            "February 2016 - November 2019"
          ],
          "list": [
            "Designed unique aesthetic mobile-first web apps.",
            "Implemented a variety of responsive web apps from the ground up for aggregating and leasing/financing semi-trucks, semi-trailers, and heavy machinery.",
            "Worked on Node.js microservices to automate data uploads of hundreds of thousands of site listings and images daily from each client's unique data structures.",
            "Heavily optimized web apps for SEO, mobile devices, and slow 3g connections, using micro-frameworks and a custom static rendering solution.",
            "Designed and implemented inventory management and leasing/financing dashboards for large semi-truck and heavy machinery dealerships and lessors.",
            "Worked with many frameworks and platforms like Vue.js, Hyperapp, Angular, Node.js, Express, Koa, Micro, Netlify, Heroku, AWS, and MongoDB.",
            "Managed targeted social media marketing campaigns across popular platforms.",
            "Implemented fine-grained conversion tracking with Google Analytics event system.",
            "Implemented an email notification system using Sparkpost."
          ]
        },
        {
          "heading": "Frontend Developer and Designer",
          "subheading": [
            "Self-employed - Indianola, Iowa",
            "August 2014 - February 2016"
          ],
          "list": [
            "Various freelance design."
          ]
        },
        {
          "heading": "Frontend Developer",
          "subheading": [
            "SevenVerbs - Urbandale, Iowa",
            "April - August 2014"
          ],
          "list": [
            "Converted existing static web designs into WordPress, Drupal, Sitefinity, and Joomla.",
            "Designed and developed original websites, business cards, logos, infographics, and other printed and digital documents.",
            "Added features, tweaked designs, and updated content on existing apps."
          ]
        }
      ]
    },
    {
      "title": "Technical",
      "column": [
        {
          "heading": "Languages / Frameworks",
          "list": [
            "Extensive knowledge of JavaScript and JS frameworks like Vue, React, Hyperapp, and Mithril.",
            "Some experience using TypeScript.",
            "Hello world's completed in Ruby, Python, Elm, and Rust.",
            "Tons of experience with CSS and CSS preprocessors."
          ]
        },
        {
          "heading": "Software",
          "list": [
            "Experienced with all kinds of creative software like Blender, Autodesk 3ds Max, Photoshop, Illustrator, After Effects, Procreate, ArtStudio Pro, Medibang, and more."
          ]
        },
        {
          "heading": "Content Management Systems",
          "list": [
            "Extensive experience with WordPress, Drupal, Sitefinity, and Joomla.",
            "Some experience with Netlify CMS, Grav CMS, Pico, Kirby, and Craft."
          ]
        }
      ]
    },
    {
      "title": "Design",
      "column": [
        {
          "heading": "Web Design",
          "list": [
            "Deep understanding of how to design responsive and adaptive mobile-first web apps.",
            "Knowledge of how to create and organize UI kits and implement style guidelines.",
            "Love for minimal CSS."
          ]
        },
        {
          "heading": "Graphic Design",
          "list": [
            "Great sense of design and acute attention to detail.",
            "Lots of experience designing for both print and digital."
          ]
        }
      ]
    },
    {
      "title": "Education",
      "column": [
        {
          "heading": "Associate of Arts and Sciences",
          "subheading": [
            "2012 - 2014",
            "DMACC Ankeny Campus"
          ],
          "list": [
            "Graphic Design with Web Emphasis"
          ]
        },
        {
          "heading": "High School Diploma",
          "subheading": [
            "2008 - 2012",
            "Southeast Warren Jr. / Sr. High School"
          ]
        }
      ]
    }
  ]
}
